Tekla Open API Reference for Tekla Structures 2025
MaterialItem.Export Method
 Exports the material item in the material database to given file name. Materials are exported to *.lis format. If path is not given material is exported to model folder. If filename is empty material name is used as filename.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual bool Export(
	ref string filename
)
Public Overridable Function Export (
	ByRef filename As String
) As Boolean
Parameters
filename
Type: System.String
The export file name of the material item.
Return Value
Type: Boolean
True on success.
Examples
using System;
using Tekla.Structures.Catalogs;
public class Example
{
       public void Example1()
       {
           MaterialItem item = new MaterialItem();
           if (item.Select("S235JR"))
           {
               string filename = System.IO.Path.GetTempPath() + "\\" + "S235JR";
               if (item.Export(ref filename))
               {
                   Console.WriteLine("S235JR material exported successfully");
               }
           }
       }
}
See Also
Reference
MaterialItem Class
Tekla.Structures.Catalogs Namespace